/*
 * 1 -1
 * 다음과 같은 간단한 기능을 하는함수르들을 작성하고, 사용자로부터 임의의 값을 입력받은 후에 테스트하여 보자.
 * (a) 주어진 정수가 짝수이면 1을 반환하고 홀수이면 0을 반환하는 함수 int even(int n)
 * (b) 주어진 정수의 절대값을 구현하는 함수 int absolute(int n)
 * (c) 주어진 정수가 음수이녀 -1을 양수이면 1을 0이면 0을 반환하는 함수 int sign(int n)
 *
 * 정수를 입력하시오 : -31
 * 주어진 정수는 홀수입니다.
 * 주어진 정수의 절대값은 31입니다
 * 주어진 정수는 음수입니다.
*/ 
/*
 * 2 - 3
 * 원의 면적을 구하는 문제를 함수로 작성하여 보자. 다음과 같은 식을 이용하라
 * 면접 = 원주율 * 반지름 * 반지름
 * (a) 사용자로부터 원의 반지름을 입력받아서 반환하는 함수를 작성하라
 * (b) 원의 면적을 구하는 함수를 작성하라
 * (c) 위의 함수들을 호출하여 사용자로부터 반지름을 받아서 원의 면적을 출력하는 전체 프로그램을 완성하라.
 *
 * 원의반지름을 입력하시오 : 5
 * 원의면적은 25입니다.
*/

/*
 * 3 -5
 * 화면에 세로로 막대 그래프를 그리는 프로그램을 다음과 같은 순서로 작성하여 보자
 * (a) 정수를 인수로 받아서 정수의 값만큼의별표 문자를 출력하는 함수 print_value(int n)을 작성하라.
 * 예를들어서 print_value(5)이면 화면에 ***** 와 같이출력한다.
 * (b) 반복구조를 사용하여 사용자로부터 값을입력받아서 print_value()를 호출하여 입력값만큼 막대를 그리는 프로그램을 완성하라
 * 사용자가 음수를 입력하면 반복을 중단한다. 
 *
 * 값을 입력하시오.(종료는 음수) : 3
 * ***
 * 값을 입력하시오.(종료는 음수) : 5
 * *****
 *
 * 값을 입력하시오.(종료는 음수) : -1
 * 종료되었습니다
 * */

/*
 * 3 - 8
 * 소수(prime number)는 1과 자기자신 외의 약수를 가지지 않는 1보다 큰 자연수이다.
 * 주어진 정수가 소수인지를 검사하는 함수 prime()을 작성하라.
 * 이 함수를 이용하여 2~100 사이의 모든 소루를 출력하라. 
 * 정수 n이 소수인지를 검하려면 2부터 n-1까지의 숫자로 n을 나누어서 한번도 나누어 떨어지지 않으면 소수이다.
 *
 * 2부터 100사이의 소수를 출력합니다.
 * 2
 * 3
 * .....
 * */

/*
 * 4 - 10
 * 2차 방정식의 근을 계산하는 함수 quad_eqn()를 작성하시오.
 * quad_eqn()함수는 abc를 나탄는 double형의 3개의 인수를 받는다.
 * 판별식이 양수인 경우에나 근을 출력하시오
 * 만약 판별식의 값이 음수이면 근이 없다는 메시지를 출력하시오.
 * a^2x + bx - c = 0
 * 2차 방정식의 계수를 입력하시오
 * a : 1
 * b : -5
 * c : 6
 * 근은 2와 3입니다.
 * */

/*
 * 5 - 16
 * 간단한 메뉴 시스템을 작성하여 보자.
 * 다음과 같은 메뉴를 선택하고 사용자로부터 입력을 방아서 입력이 올바른지를 검사한다.
 * 메뉴를 실제로 실행할 필요는 없다.
 * 다만 메뉴의 이름을 화면에 출력하고 다시 반복한다.
 * 1. 햄버거
 * 2. 치즈버거
 * 3. 샌드위치
 * 4. 종료 
 * 원하는 메뉴를 선택하시오 : 1
 * 1번메뉴가 선택 되었습니다.
 */
