/*
 * 1 - 1
 * 덧셈, 뺄셈, 곱셈, 나눗셈을 지원하는 계산기 프로그램을 작성하여 보자.
 * 이번에는 각 연산 들이 몇번씩 계산되었는지를 기억하게 하자.
 * 각 연산을 지원하는 함수들은 자신이 호출된 횟수를 화면에 출력한다.
 *
 * 연산을 입력하시오 : 1 + 2
 * 연산 결과 : 3
 * 덧셈은 총 1번 실행되었습니다.
 *
 * 연산을 입력하시오 : 1 * 2
 * 연산결과 : 2
 * 곱셈은 총 1번 실행되었습니다.
 *
 * 연산을 입력하시오 : 5 + 3
 * 연산결과 : 8
 * 덧셈은 총 2번 실행되었습니다.
 *
 * (a) 정적지역변수를 아요하여 프로그램을 작성하라
 * (b) 전역 변수를 이용하여 프로그램을 작성하라
 * */

/*
 * 2 - 4
 * 돈만 생기면 저금하는 사람을 가정하자.
 * 이 사람을 위한 함수 save(int amount) 를 작성하여 보자.
 * 이 함수는 저금할 금액을 나타내는 하나의 인수 amount만을 받으며 save(100)과 같이 호출된다.
 * save()는 현재까지 저축된 총액을 기억하고 있으며 한번 호출될 때마다 총 저축액을 화면에 출력한다.
 * */
